namespace practice_4th_semester
{
    internal class Roads
    {
        /*
        
        n дорог
        m роботов
        роботы имеют скорость - 1 или 2
        при попадании роботов на одну дорогу любой длины считается, что они все встретились?
        для первого случая все дороги - 1:
        
            при скорости 1:
                за 1 тик робот из города попадает на дорогу/с дороги в город
        
            при скорости 2:
                робот моментально перемещается в другой город



         */
    }
}
